MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/nuc125/thirdparty/nuc125/bpwm_reg.h
#define BPWM_CTL0_CTRLD0_Pos              (0)                                              /*!< BPWM_T::CTL: CTRLD0 Position           */
#define BPWM_CTL0_CTRLD0_Msk              (0x1ul << BPWM_CTL0_CTRLD0_Pos)                  /*!< BPWM_T::CTL: CTRLD0 Mask               */

#define BPWM_CTL0_CTRLD1_Pos              (1)                                              /*!< BPWM_T::CTL: CTRLD1 Position           */
#define BPWM_CTL0_CTRLD1_Msk              (0x1ul << BPWM_CTL0_CTRLD1_Pos)                  /*!< BPWM_T::CTL: CTRLD1 Mask               */

#define BPWM_CTL0_CTRLD2_Pos              (2)                                              /*!< BPWM_T::CTL: CTRLD2 Position           */
#define BPWM_CTL0_CTRLD2_Msk              (0x1ul << BPWM_CTL0_CTRLD2_Pos)                  /*!< BPWM_T::CTL: CTRLD2 Mask               */

#define BPWM_CTL0_CTRLD3_Pos              (3)                                              /*!< BPWM_T::CTL: CTRLD3 Position           */
#define BPWM_CTL0_CTRLD3_Msk              (0x1ul << BPWM_CTL0_CTRLD3_Pos)                  /*!< BPWM_T::CTL: CTRLD3 Mask               */

#define BPWM_CTL0_CTRLD4_Pos              (4)                                              /*!< BPWM_T::CTL: CTRLD4 Position           */
#define BPWM_CTL0_CTRLD4_Msk              (0x1ul << BPWM_CTL0_CTRLD4_Pos)                  /*!< BPWM_T::CTL: CTRLD4 Mask               */

#define BPWM_CTL0_CTRLD5_Pos              (5)                                              /*!< BPWM_T::CTL: CTRLD5 Position           */
#define BPWM_CTL0_CTRLD5_Msk              (0x1ul << BPWM_CTL0_CTRLD5_Pos)                  /*!< BPWM_T::CTL: CTRLD5 Mask               */

#define BPWM_CTL0_IMMLDEN0_Pos            (16)                                             /*!< BPWM_T::CTL: IMMLDEN0 Position         */
#define BPWM_CTL0_IMMLDEN0_Msk            (0x1ul << BPWM_CTL0_IMMLDEN0_Pos)                /*!< BPWM_T::CTL: IMMLDEN0 Mask             */

#define BPWM_CTL0_IMMLDEN1_Pos            (17)                                             /*!< BPWM_T::CTL: IMMLDEN1 Position         */
#define BPWM_CTL0_IMMLDEN1_Msk            (0x1ul << BPWM_CTL0_IMMLDEN1_Pos)                /*!< BPWM_T::CTL: IMMLDEN1 Mask             */

#define BPWM_CTL0_IMMLDEN2_Pos            (18)                                             /*!< BPWM_T::CTL: IMMLDEN2 Position         */
#define BPWM_CTL0_IMMLDEN2_Msk            (0x1ul << BPWM_CTL0_IMMLDEN2_Pos)                /*!< BPWM_T::CTL: IMMLDEN2 Mask             */

#define BPWM_CTL0_IMMLDEN3_Pos            (19)                                             /*!< BPWM_T::CTL: IMMLDEN3 Position         */
#define BPWM_CTL0_IMMLDEN3_Msk            (0x1ul << BPWM_CTL0_IMMLDEN3_Pos)                /*!< BPWM_T::CTL: IMMLDEN3 Mask             */

#define BPWM_CTL0_IMMLDEN4_Pos            (20)                                             /*!< BPWM_T::CTL: IMMLDEN4 Position         */
#define BPWM_CTL0_IMMLDEN4_Msk            (0x1ul << BPWM_CTL0_IMMLDEN4_Pos)                /*!< BPWM_T::CTL: IMMLDEN4 Mask             */

#define BPWM_CTL0_IMMLDEN5_Pos            (21)                                             /*!< BPWM_T::CTL: IMMLDEN5 Position         */
#define BPWM_CTL0_IMMLDEN5_Msk            (0x1ul << BPWM_CTL0_IMMLDEN5_Pos)                /*!< BPWM_T::CTL: IMMLDEN5 Mask             */

#define BPWM_CTL0_DBGHALT_Pos            (30)                                              /*!< BPWM_T::CTL0: DBGHALT Position         */
#define BPWM_CTL0_DBGHALT_Msk            (0x1ul << BPWM_CTL0_DBGHALT_Pos)                  /*!< BPWM_T::CTL0: DBGHALT Mask             */

#define BPWM_CTL0_DBGTRIOFF_Pos          (31)                                              /*!< BPWM_T::CTL0: DBGTRIOFF Position       */
#define BPWM_CTL0_DBGTRIOFF_Msk          (0x1ul << BPWM_CTL0_DBGTRIOFF_Pos)                /*!< BPWM_T::CTL0: DBGTRIOFF Mask           */

#define BPWM_CTL1_CNTTYPE0_Pos           (0)                                               /*!< BPWM_T::CTL1: CNTTYPE0 Position        */
#define BPWM_CTL1_CNTTYPE0_Msk           (0x3ul << BPWM_CTL1_CNTTYPE0_Pos)                 /*!< BPWM_T::CTL1: CNTTYPE0 Mask            */

#define BPWM_CLKSRC_ECLKSRC0_Pos         (0)                                               /*!< BPWM_T::CLKSRC: ECLKSRC0 Position      */
#define BPWM_CLKSRC_ECLKSRC0_Msk         (0x7ul << BPWM_CLKSRC_ECLKSRC0_Pos)               /*!< BPWM_T::CLKSRC: ECLKSRC0 Mask          */

#define BPWM_CLKPSC_CLKPSC_Pos           (0)                                               /*!< BPWM_T::CLKPSC: CLKPSC Position        */
#define BPWM_CLKPSC_CLKPSC_Msk           (0xffful << BPWM_CLKPSC_CLKPSC_Pos)               /*!< BPWM_T::CLKPSC: CLKPSC Mask            */

#define BPWM_CNTEN_CNTEN0_Pos            (0)                                               /*!< BPWM_T::CNTEN: CNTEN0 Position         */
#define BPWM_CNTEN_CNTEN0_Msk            (0x1ul << BPWM_CNTEN_CNTEN0_Pos)                  /*!< BPWM_T::CNTEN: CNTEN0 Mask             */

#define BPWM_CNTCLR_CNTCLR0_Pos          (0)                                               /*!< BPWM_T::CNTCLR: CNTCLR0 Position       */
#define BPWM_CNTCLR_CNTCLR0_Msk          (0x1ul << BPWM_CNTCLR_CNTCLR0_Pos)                /*!< BPWM_T::CNTCLR: CNTCLR0 Mask           */

#define BPWM_PERIOD_PERIOD_Pos           (0)                                               /*!< BPWM_T::PERIOD: PERIOD Position        */
#define BPWM_PERIOD_PERIOD_Msk           (0xfffful << BPWM_PERIOD_PERIOD_Pos)              /*!< BPWM_T::PERIOD: PERIOD Mask            */

#define BPWM_CMPDAT_CMP_Pos              (0)                                               /*!< BPWM_T::CMPDAT: CMP Position           */
#define BPWM_CMPDAT_CMP_Msk              (0xfffful << BPWM_CMPDAT_CMP_Pos)                 /*!< BPWM_T::CMPDAT: CMP Mask               */

#define BPWM_CNT_CNT_Pos                 (0)                                               /*!< BPWM_T::CNT: CNT Position              */
#define BPWM_CNT_CNT_Msk                 (0xfffful << BPWM_CNT_CNT_Pos)                    /*!< BPWM_T::CNT: CNT Mask                  */

