MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/nuc125/thirdparty/nuc125/bpwm_reg.h
#define BPWM_WGCTL1_CMPDCTL4_Pos          (24)                                             /*!< BPWM_T::WGCTL1: CMPDCTL4 Position      */
#define BPWM_WGCTL1_CMPDCTL4_Msk          (0x3ul << BPWM_WGCTL1_CMPDCTL4_Pos)              /*!< BPWM_T::WGCTL1: CMPDCTL4 Mask          */

#define BPWM_WGCTL1_CMPDCTL5_Pos          (26)                                             /*!< BPWM_T::WGCTL1: CMPDCTL5 Position      */
#define BPWM_WGCTL1_CMPDCTL5_Msk          (0x3ul << BPWM_WGCTL1_CMPDCTL5_Pos)              /*!< BPWM_T::WGCTL1: CMPDCTL5 Mask          */


#define BPWM_MSKEN_MSKEN0_Pos             (0)                                              /*!< BPWM_T::MSKEN: MSKEN0 Position         */
#define BPWM_MSKEN_MSKEN0_Msk             (0x1ul << BPWM_MSKEN_MSKEN0_Pos)                 /*!< BPWM_T::MSKEN: MSKEN0 Mask             */

#define BPWM_MSKEN_MSKEN1_Pos             (1)                                              /*!< BPWM_T::MSKEN: MSKEN1 Position         */
#define BPWM_MSKEN_MSKEN1_Msk             (0x1ul << BPWM_MSKEN_MSKEN1_Pos)                 /*!< BPWM_T::MSKEN: MSKEN1 Mask             */

#define BPWM_MSKEN_MSKEN2_Pos             (2)                                              /*!< BPWM_T::MSKEN: MSKEN2 Position         */
#define BPWM_MSKEN_MSKEN2_Msk             (0x1ul << BPWM_MSKEN_MSKEN2_Pos)                 /*!< BPWM_T::MSKEN: MSKEN2 Mask             */

#define BPWM_MSKEN_MSKEN3_Pos             (3)                                              /*!< BPWM_T::MSKEN: MSKEN3 Position         */
#define BPWM_MSKEN_MSKEN3_Msk             (0x1ul << BPWM_MSKEN_MSKEN3_Pos)                 /*!< BPWM_T::MSKEN: MSKEN3 Mask             */

#define BPWM_MSKEN_MSKEN4_Pos             (4)                                              /*!< BPWM_T::MSKEN: MSKEN4 Position         */
#define BPWM_MSKEN_MSKEN4_Msk             (0x1ul << BPWM_MSKEN_MSKEN4_Pos)                 /*!< BPWM_T::MSKEN: MSKEN4 Mask             */

#define BPWM_MSKEN_MSKEN5_Pos             (5)                                              /*!< BPWM_T::MSKEN: MSKEN5 Position         */
#define BPWM_MSKEN_MSKEN5_Msk             (0x1ul << BPWM_MSKEN_MSKEN5_Pos)                 /*!< BPWM_T::MSKEN: MSKEN5 Mask             */

#define BPWM_MSK_MSKDAT0_Pos              (0)                                              /*!< BPWM_T::MSK: MSKDAT0 Position          */
#define BPWM_MSK_MSKDAT0_Msk              (0x1ul << BPWM_MSK_MSKDAT0_Pos)                  /*!< BPWM_T::MSK: MSKDAT0 Mask              */

#define BPWM_MSK_MSKDAT1_Pos              (1)                                              /*!< BPWM_T::MSK: MSKDAT1 Position          */
#define BPWM_MSK_MSKDAT1_Msk              (0x1ul << BPWM_MSK_MSKDAT1_Pos)                  /*!< BPWM_T::MSK: MSKDAT1 Mask              */

#define BPWM_MSK_MSKDAT2_Pos              (2)                                              /*!< BPWM_T::MSK: MSKDAT2 Position          */
#define BPWM_MSK_MSKDAT2_Msk              (0x1ul << BPWM_MSK_MSKDAT2_Pos)                  /*!< BPWM_T::MSK: MSKDAT2 Mask              */

#define BPWM_MSK_MSKDAT3_Pos              (3)                                              /*!< BPWM_T::MSK: MSKDAT3 Position          */
#define BPWM_MSK_MSKDAT3_Msk              (0x1ul << BPWM_MSK_MSKDAT3_Pos)                  /*!< BPWM_T::MSK: MSKDAT3 Mask              */

#define BPWM_MSK_MSKDAT4_Pos              (4)                                              /*!< BPWM_T::MSK: MSKDAT4 Position          */
#define BPWM_MSK_MSKDAT4_Msk              (0x1ul << BPWM_MSK_MSKDAT4_Pos)                  /*!< BPWM_T::MSK: MSKDAT4 Mask              */

#define BPWM_MSK_MSKDAT5_Pos              (5)                                              /*!< BPWM_T::MSK: MSKDAT5 Position          */
#define BPWM_MSK_MSKDAT5_Msk              (0x1ul << BPWM_MSK_MSKDAT5_Pos)                  /*!< BPWM_T::MSK: MSKDAT5 Mask              */

#define BPWM_POLCTL_PINV0_Pos             (0)                                              /*!< BPWM_T::POLCTL: PINV0 Position         */
#define BPWM_POLCTL_PINV0_Msk             (0x1ul << BPWM_POLCTL_PINV0_Pos)                 /*!< BPWM_T::POLCTL: PINV0 Mask             */

#define BPWM_POLCTL_PINV1_Pos             (1)                                              /*!< BPWM_T::POLCTL: PINV1 Position         */
#define BPWM_POLCTL_PINV1_Msk             (0x1ul << BPWM_POLCTL_PINV1_Pos)                 /*!< BPWM_T::POLCTL: PINV1 Mask             */

#define BPWM_POLCTL_PINV2_Pos             (2)                                              /*!< BPWM_T::POLCTL: PINV2 Position         */
#define BPWM_POLCTL_PINV2_Msk             (0x1ul << BPWM_POLCTL_PINV2_Pos)                 /*!< BPWM_T::POLCTL: PINV2 Mask             */

#define BPWM_POLCTL_PINV3_Pos             (3)                                              /*!< BPWM_T::POLCTL: PINV3 Position         */
#define BPWM_POLCTL_PINV3_Msk             (0x1ul << BPWM_POLCTL_PINV3_Pos)                 /*!< BPWM_T::POLCTL: PINV3 Mask             */

#define BPWM_POLCTL_PINV4_Pos             (4)                                              /*!< BPWM_T::POLCTL: PINV4 Position         */
#define BPWM_POLCTL_PINV4_Msk             (0x1ul << BPWM_POLCTL_PINV4_Pos)                 /*!< BPWM_T::POLCTL: PINV4 Mask             */

#define BPWM_POLCTL_PINV5_Pos             (5)                                              /*!< BPWM_T::POLCTL: PINV5 Position         */
#define BPWM_POLCTL_PINV5_Msk             (0x1ul << BPWM_POLCTL_PINV5_Pos)                 /*!< BPWM_T::POLCTL: PINV5 Mask             */

#define BPWM_POEN_POEN0_Pos               (0)                                              /*!< BPWM_T::POEN: POEN0 Position           */
#define BPWM_POEN_POEN0_Msk               (0x1ul << BPWM_POEN_POEN0_Pos)                   /*!< BPWM_T::POEN: POEN0 Mask               */

#define BPWM_POEN_POEN1_Pos               (1)                                              /*!< BPWM_T::POEN: POEN1 Position           */
#define BPWM_POEN_POEN1_Msk               (0x1ul << BPWM_POEN_POEN1_Pos)                   /*!< BPWM_T::POEN: POEN1 Mask               */

#define BPWM_POEN_POEN2_Pos               (2)                                              /*!< BPWM_T::POEN: POEN2 Position           */
#define BPWM_POEN_POEN2_Msk               (0x1ul << BPWM_POEN_POEN2_Pos)                   /*!< BPWM_T::POEN: POEN2 Mask               */

#define BPWM_POEN_POEN3_Pos               (3)                                              /*!< BPWM_T::POEN: POEN3 Position           */
#define BPWM_POEN_POEN3_Msk               (0x1ul << BPWM_POEN_POEN3_Pos)                   /*!< BPWM_T::POEN: POEN3 Mask               */

#define BPWM_POEN_POEN4_Pos               (4)                                              /*!< BPWM_T::POEN: POEN4 Position           */
#define BPWM_POEN_POEN4_Msk               (0x1ul << BPWM_POEN_POEN4_Pos)                   /*!< BPWM_T::POEN: POEN4 Mask               */

#define BPWM_POEN_POEN5_Pos               (5)                                              /*!< BPWM_T::POEN: POEN5 Position           */
#define BPWM_POEN_POEN5_Msk               (0x1ul << BPWM_POEN_POEN5_Pos)                   /*!< BPWM_T::POEN: POEN5 Mask               */

#define BPWM_INTEN_ZIEN0_Pos             (0)                                               /*!< BPWM_T::INTEN: ZIEN0 Position          */
#define BPWM_INTEN_ZIEN0_Msk             (0x1ul << BPWM_INTEN_ZIEN0_Pos)                   /*!< BPWM_T::INTEN: ZIEN0 Mask              */

#define BPWM_INTEN_PIEN0_Pos             (8)                                               /*!< BPWM_T::INTEN: PIEN0 Position          */
#define BPWM_INTEN_PIEN0_Msk             (0x1ul << BPWM_INTEN_PIEN0_Pos)                   /*!< BPWM_T::INTEN: PIEN0 Mask              */

#define BPWM_INTEN_CMPUIEN0_Pos           (16)                                             /*!< BPWM_T::INTEN: CMPUIEN0 Position       */
#define BPWM_INTEN_CMPUIEN0_Msk           (0x1ul << BPWM_INTEN_CMPUIEN0_Pos)               /*!< BPWM_T::INTEN: CMPUIEN0 Mask           */

#define BPWM_INTEN_CMPUIEN1_Pos           (17)                                             /*!< BPWM_T::INTEN: CMPUIEN1 Position       */
#define BPWM_INTEN_CMPUIEN1_Msk           (0x1ul << BPWM_INTEN_CMPUIEN1_Pos)               /*!< BPWM_T::INTEN: CMPUIEN1 Mask           */

#define BPWM_INTEN_CMPUIEN2_Pos           (18)                                             /*!< BPWM_T::INTEN: CMPUIEN2 Position       */
#define BPWM_INTEN_CMPUIEN2_Msk           (0x1ul << BPWM_INTEN_CMPUIEN2_Pos)               /*!< BPWM_T::INTEN: CMPUIEN2 Mask           */

#define BPWM_INTEN_CMPUIEN3_Pos           (19)                                             /*!< BPWM_T::INTEN: CMPUIEN3 Position       */
#define BPWM_INTEN_CMPUIEN3_Msk           (0x1ul << BPWM_INTEN_CMPUIEN3_Pos)               /*!< BPWM_T::INTEN: CMPUIEN3 Mask           */

#define BPWM_INTEN_CMPUIEN4_Pos           (20)                                             /*!< BPWM_T::INTEN: CMPUIEN4 Position       */
#define BPWM_INTEN_CMPUIEN4_Msk           (0x1ul << BPWM_INTEN_CMPUIEN4_Pos)               /*!< BPWM_T::INTEN: CMPUIEN4 Mask           */

#define BPWM_INTEN_CMPUIEN5_Pos           (21)                                             /*!< BPWM_T::INTEN: CMPUIEN5 Position       */
#define BPWM_INTEN_CMPUIEN5_Msk           (0x1ul << BPWM_INTEN_CMPUIEN5_Pos)               /*!< BPWM_T::INTEN: CMPUIEN5 Mask           */

#define BPWM_INTEN_CMPDIEN0_Pos           (24)                                             /*!< BPWM_T::INTEN: CMPDIEN0 Position       */
#define BPWM_INTEN_CMPDIEN0_Msk           (0x1ul << BPWM_INTEN_CMPDIEN0_Pos)               /*!< BPWM_T::INTEN: CMPDIEN0 Mask           */

#define BPWM_INTEN_CMPDIEN1_Pos           (25)                                             /*!< BPWM_T::INTEN: CMPDIEN1 Position       */
#define BPWM_INTEN_CMPDIEN1_Msk           (0x1ul << BPWM_INTEN_CMPDIEN1_Pos)               /*!< BPWM_T::INTEN: CMPDIEN1 Mask           */

#define BPWM_INTEN_CMPDIEN2_Pos           (26)                                             /*!< BPWM_T::INTEN: CMPDIEN2 Position       */
#define BPWM_INTEN_CMPDIEN2_Msk           (0x1ul << BPWM_INTEN_CMPDIEN2_Pos)               /*!< BPWM_T::INTEN: CMPDIEN2 Mask           */

