MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/nuc125/thirdparty/nuc125/bpwm_reg.h
#define BPWM_INTEN_CMPDIEN3_Pos           (27)                                             /*!< BPWM_T::INTEN: CMPDIEN3 Position       */
#define BPWM_INTEN_CMPDIEN3_Msk           (0x1ul << BPWM_INTEN_CMPDIEN3_Pos)               /*!< BPWM_T::INTEN: CMPDIEN3 Mask           */

#define BPWM_INTEN_CMPDIEN4_Pos           (28)                                             /*!< BPWM_T::INTEN: CMPDIEN4 Position       */
#define BPWM_INTEN_CMPDIEN4_Msk           (0x1ul << BPWM_INTEN_CMPDIEN4_Pos)               /*!< BPWM_T::INTEN: CMPDIEN4 Mask           */

#define BPWM_INTEN_CMPDIEN5_Pos           (29)                                             /*!< BPWM_T::INTEN: CMPDIEN5 Position       */
#define BPWM_INTEN_CMPDIEN5_Msk           (0x1ul << BPWM_INTEN_CMPDIEN5_Pos)               /*!< BPWM_T::INTEN: CMPDIEN5 Mask           */

#define BPWM_INTSTS0_ZIF0_Pos            (0)                                               /*!< BPWM_T::INTSTS0: ZIF0 Position         */
#define BPWM_INTSTS0_ZIF0_Msk            (0x1ul << BPWM_INTSTS0_ZIF0_Pos)                  /*!< BPWM_T::INTSTS0: ZIF0 Mask             */

#define BPWM_INTSTS0_PIF0_Pos            (8)                                               /*!< BPWM_T::INTSTS0: PIF0 Position         */
#define BPWM_INTSTS0_PIF0_Msk            (0x1ul << BPWM_INTSTS0_PIF0_Pos)                  /*!< BPWM_T::INTSTS0: PIF0 Mask             */

#define BPWM_INTSTS0_CMPUIF0_Pos           (16)                                            /*!< BPWM_T::INTSTS0: CMPUIF0 Position      */
#define BPWM_INTSTS0_CMPUIF0_Msk           (0x1ul << BPWM_INTSTS0_CMPUIF0_Pos)             /*!< BPWM_T::INTSTS0: CMPUIF0 Mask          */

#define BPWM_INTSTS0_CMPUIF1_Pos           (17)                                            /*!< BPWM_T::INTSTS0: CMPUIF1 Position      */
#define BPWM_INTSTS0_CMPUIF1_Msk           (0x1ul << BPWM_INTSTS0_CMPUIF1_Pos)             /*!< BPWM_T::INTSTS0: CMPUIF1 Mask          */

#define BPWM_INTSTS0_CMPUIF2_Pos           (18)                                            /*!< BPWM_T::INTSTS0: CMPUIF2 Position      */
#define BPWM_INTSTS0_CMPUIF2_Msk           (0x1ul << BPWM_INTSTS0_CMPUIF2_Pos)             /*!< BPWM_T::INTSTS0: CMPUIF2 Mask          */

#define BPWM_INTSTS0_CMPUIF3_Pos           (19)                                            /*!< BPWM_T::INTSTS0: CMPUIF3 Position      */
#define BPWM_INTSTS0_CMPUIF3_Msk           (0x1ul << BPWM_INTSTS0_CMPUIF3_Pos)             /*!< BPWM_T::INTSTS0: CMPUIF3 Mask          */

#define BPWM_INTSTS0_CMPUIF4_Pos           (20)                                            /*!< BPWM_T::INTSTS0: CMPUIF4 Position      */
#define BPWM_INTSTS0_CMPUIF4_Msk           (0x1ul << BPWM_INTSTS0_CMPUIF4_Pos)             /*!< BPWM_T::INTSTS0: CMPUIF4 Mask          */

#define BPWM_INTSTS0_CMPUIF5_Pos           (21)                                            /*!< BPWM_T::INTSTS0: CMPUIF5 Position      */
#define BPWM_INTSTS0_CMPUIF5_Msk           (0x1ul << BPWM_INTSTS0_CMPUIF5_Pos)             /*!< BPWM_T::INTSTS0: CMPUIF5 Mask          */

#define BPWM_INTSTS0_CMPDIF0_Pos           (24)                                            /*!< BPWM_T::INTSTS0: CMPDIF0 Position      */
#define BPWM_INTSTS0_CMPDIF0_Msk           (0x1ul << BPWM_INTSTS0_CMPDIF0_Pos)             /*!< BPWM_T::INTSTS0: CMPDIF0 Mask          */

#define BPWM_INTSTS0_CMPDIF1_Pos           (25)                                            /*!< BPWM_T::INTSTS0: CMPDIF1 Position      */
#define BPWM_INTSTS0_CMPDIF1_Msk           (0x1ul << BPWM_INTSTS0_CMPDIF1_Pos)             /*!< BPWM_T::INTSTS0: CMPDIF1 Mask          */

#define BPWM_INTSTS0_CMPDIF2_Pos           (26)                                            /*!< BPWM_T::INTSTS0: CMPDIF2 Position      */
#define BPWM_INTSTS0_CMPDIF2_Msk           (0x1ul << BPWM_INTSTS0_CMPDIF2_Pos)             /*!< BPWM_T::INTSTS0: CMPDIF2 Mask          */

#define BPWM_INTSTS0_CMPDIF3_Pos           (27)                                            /*!< BPWM_T::INTSTS0: CMPDIF3 Position      */
#define BPWM_INTSTS0_CMPDIF3_Msk           (0x1ul << BPWM_INTSTS0_CMPDIF3_Pos)             /*!< BPWM_T::INTSTS0: CMPDIF3 Mask          */

#define BPWM_INTSTS0_CMPDIF4_Pos           (28)                                            /*!< BPWM_T::INTSTS0: CMPDIF4 Position      */
#define BPWM_INTSTS0_CMPDIF4_Msk           (0x1ul << BPWM_INTSTS0_CMPDIF4_Pos)             /*!< BPWM_T::INTSTS0: CMPDIF4 Mask          */

#define BPWM_INTSTS0_CMPDIF5_Pos           (29)                                            /*!< BPWM_T::INTSTS0: CMPDIF5 Position      */
#define BPWM_INTSTS0_CMPDIF5_Msk           (0x1ul << BPWM_INTSTS0_CMPDIF5_Pos)             /*!< BPWM_T::INTSTS0: CMPDIF5 Mask          */

#define BPWM_ADCTS0_TRGSEL0_Pos          (0)                                               /*!< BPWM_T::ADCTS0: TRGSEL0 Position       */
#define BPWM_ADCTS0_TRGSEL0_Msk          (0xful << BPWM_ADCTS0_TRGSEL0_Pos)                /*!< BPWM_T::ADCTS0: TRGSEL0 Mask           */

#define BPWM_ADCTS0_TRGEN0_Pos           (7)                                               /*!< BPWM_T::ADCTS0: TRGEN0 Position        */
#define BPWM_ADCTS0_TRGEN0_Msk           (0x1ul << BPWM_ADCTS0_TRGEN0_Pos)                 /*!< BPWM_T::ADCTS0: TRGEN0 Mask            */

#define BPWM_ADCTS0_TRGSEL1_Pos          (8)                                               /*!< BPWM_T::ADCTS0: TRGSEL1 Position       */
#define BPWM_ADCTS0_TRGSEL1_Msk          (0xful << BPWM_ADCTS0_TRGSEL1_Pos)                /*!< BPWM_T::ADCTS0: TRGSEL1 Mask           */

#define BPWM_ADCTS0_TRGEN1_Pos           (15)                                              /*!< BPWM_T::ADCTS0: TRGEN1 Position        */
#define BPWM_ADCTS0_TRGEN1_Msk           (0x1ul << BPWM_ADCTS0_TRGEN1_Pos)                 /*!< BPWM_T::ADCTS0: TRGEN1 Mask            */

#define BPWM_ADCTS0_TRGSEL2_Pos          (16)                                              /*!< BPWM_T::ADCTS0: TRGSEL2 Position       */
#define BPWM_ADCTS0_TRGSEL2_Msk          (0xful << BPWM_ADCTS0_TRGSEL2_Pos)                /*!< BPWM_T::ADCTS0: TRGSEL2 Mask           */

