MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/nuc125/thirdparty/nuc125/bpwm_reg.h
#define BPWM_CAPSTS_CRLIFOV1_Pos          (1)                                              /*!< BPWM_T::CAPSTS: CRLIFOV1 Position      */
#define BPWM_CAPSTS_CRLIFOV1_Msk          (0x1ul << BPWM_CAPSTS_CRLIFOV1_Pos)              /*!< BPWM_T::CAPSTS: CRLIFOV1 Mask          */

#define BPWM_CAPSTS_CRLIFOV2_Pos          (2)                                              /*!< BPWM_T::CAPSTS: CRLIFOV2 Position      */
#define BPWM_CAPSTS_CRLIFOV2_Msk          (0x1ul << BPWM_CAPSTS_CRLIFOV2_Pos)              /*!< BPWM_T::CAPSTS: CRLIFOV2 Mask          */

#define BPWM_CAPSTS_CRLIFOV3_Pos          (3)                                              /*!< BPWM_T::CAPSTS: CRLIFOV3 Position      */
#define BPWM_CAPSTS_CRLIFOV3_Msk          (0x1ul << BPWM_CAPSTS_CRLIFOV3_Pos)              /*!< BPWM_T::CAPSTS: CRLIFOV3 Mask          */

#define BPWM_CAPSTS_CRLIFOV4_Pos          (4)                                              /*!< BPWM_T::CAPSTS: CRLIFOV4 Position      */
#define BPWM_CAPSTS_CRLIFOV4_Msk          (0x1ul << BPWM_CAPSTS_CRLIFOV4_Pos)              /*!< BPWM_T::CAPSTS: CRLIFOV4 Mask          */

#define BPWM_CAPSTS_CRLIFOV5_Pos          (5)                                              /*!< BPWM_T::CAPSTS: CRLIFOV5 Position      */
#define BPWM_CAPSTS_CRLIFOV5_Msk          (0x1ul << BPWM_CAPSTS_CRLIFOV5_Pos)              /*!< BPWM_T::CAPSTS: CRLIFOV5 Mask          */

#define BPWM_CAPSTS_CFLIFOV0_Pos          (8)                                              /*!< BPWM_T::CAPSTS: CFLIFOV0 Position      */
#define BPWM_CAPSTS_CFLIFOV0_Msk          (0x1ul << BPWM_CAPSTS_CFLIFOV0_Pos)              /*!< BPWM_T::CAPSTS: CFLIFOV0 Mask          */

#define BPWM_CAPSTS_CFLIFOV1_Pos          (9)                                              /*!< BPWM_T::CAPSTS: CFLIFOV1 Position      */
#define BPWM_CAPSTS_CFLIFOV1_Msk          (0x1ul << BPWM_CAPSTS_CFLIFOV1_Pos)              /*!< BPWM_T::CAPSTS: CFLIFOV1 Mask          */

#define BPWM_CAPSTS_CFLIFOV2_Pos          (10)                                             /*!< BPWM_T::CAPSTS: CFLIFOV2 Position      */
#define BPWM_CAPSTS_CFLIFOV2_Msk          (0x1ul << BPWM_CAPSTS_CFLIFOV2_Pos)              /*!< BPWM_T::CAPSTS: CFLIFOV2 Mask          */

#define BPWM_CAPSTS_CFLIFOV3_Pos          (11)                                             /*!< BPWM_T::CAPSTS: CFLIFOV3 Position      */
#define BPWM_CAPSTS_CFLIFOV3_Msk          (0x1ul << BPWM_CAPSTS_CFLIFOV3_Pos)              /*!< BPWM_T::CAPSTS: CFLIFOV3 Mask          */

#define BPWM_CAPSTS_CFLIFOV4_Pos          (12)                                             /*!< BPWM_T::CAPSTS: CFLIFOV4 Position      */
#define BPWM_CAPSTS_CFLIFOV4_Msk          (0x1ul << BPWM_CAPSTS_CFLIFOV4_Pos)              /*!< BPWM_T::CAPSTS: CFLIFOV4 Mask          */

#define BPWM_CAPSTS_CFLIFOV5_Pos          (13)                                             /*!< BPWM_T::CAPSTS: CFLIFOV5 Position      */
#define BPWM_CAPSTS_CFLIFOV5_Msk          (0x1ul << BPWM_CAPSTS_CFLIFOV5_Pos)              /*!< BPWM_T::CAPSTS: CFLIFOV5 Mask          */

#define BPWM_RCAPDAT0_RCAPDAT_Pos        (0)                                               /*!< BPWM_T::RCAPDAT0: RCAPDAT Position     */
#define BPWM_RCAPDAT0_RCAPDAT_Msk        (0xfffful << BPWM_RCAPDAT0_RCAPDAT_Pos)           /*!< BPWM_T::RCAPDAT0: RCAPDAT Mask         */

#define BPWM_FCAPDAT0_FCAPDAT_Pos        (0)                                               /*!< BPWM_T::FCAPDAT0: FCAPDAT Position     */
#define BPWM_FCAPDAT0_FCAPDAT_Msk        (0xfffful << BPWM_FCAPDAT0_FCAPDAT_Pos)           /*!< BPWM_T::FCAPDAT0: FCAPDAT Mask         */

#define BPWM_RCAPDAT1_RCAPDAT_Pos        (0)                                               /*!< BPWM_T::RCAPDAT1: RCAPDAT Position     */
#define BPWM_RCAPDAT1_RCAPDAT_Msk        (0xfffful << BPWM_RCAPDAT1_RCAPDAT_Pos)           /*!< BPWM_T::RCAPDAT1: RCAPDAT Mask         */

#define BPWM_FCAPDAT1_FCAPDAT_Pos        (0)                                               /*!< BPWM_T::FCAPDAT1: FCAPDAT Position     */
#define BPWM_FCAPDAT1_FCAPDAT_Msk        (0xfffful << BPWM_FCAPDAT1_FCAPDAT_Pos)           /*!< BPWM_T::FCAPDAT1: FCAPDAT Mask         */

#define BPWM_RCAPDAT2_RCAPDAT_Pos        (0)                                               /*!< BPWM_T::RCAPDAT2: RCAPDAT Position     */
#define BPWM_RCAPDAT2_RCAPDAT_Msk        (0xfffful << BPWM_RCAPDAT2_RCAPDAT_Pos)           /*!< BPWM_T::RCAPDAT2: RCAPDAT Mask         */

#define BPWM_FCAPDAT2_FCAPDAT_Pos        (0)                                               /*!< BPWM_T::FCAPDAT2: FCAPDAT Position     */
#define BPWM_FCAPDAT2_FCAPDAT_Msk        (0xfffful << BPWM_FCAPDAT2_FCAPDAT_Pos)           /*!< BPWM_T::FCAPDAT2: FCAPDAT Mask         */

#define BPWM_RCAPDAT3_RCAPDAT_Pos        (0)                                               /*!< BPWM_T::RCAPDAT3: RCAPDAT Position     */
#define BPWM_RCAPDAT3_RCAPDAT_Msk        (0xfffful << BPWM_RCAPDAT3_RCAPDAT_Pos)           /*!< BPWM_T::RCAPDAT3: RCAPDAT Mask         */

#define BPWM_FCAPDAT3_FCAPDAT_Pos        (0)                                               /*!< BPWM_T::FCAPDAT3: FCAPDAT Position     */
#define BPWM_FCAPDAT3_FCAPDAT_Msk        (0xfffful << BPWM_FCAPDAT3_FCAPDAT_Pos)           /*!< BPWM_T::FCAPDAT3: FCAPDAT Mask         */

#define BPWM_RCAPDAT4_RCAPDAT_Pos        (0)                                               /*!< BPWM_T::RCAPDAT4: RCAPDAT Position     */
#define BPWM_RCAPDAT4_RCAPDAT_Msk        (0xfffful << BPWM_RCAPDAT4_RCAPDAT_Pos)           /*!< BPWM_T::RCAPDAT4: RCAPDAT Mask         */

#define BPWM_FCAPDAT4_FCAPDAT_Pos        (0)                                               /*!< BPWM_T::FCAPDAT4: FCAPDAT Position     */
#define BPWM_FCAPDAT4_FCAPDAT_Msk        (0xfffful << BPWM_FCAPDAT4_FCAPDAT_Pos)           /*!< BPWM_T::FCAPDAT4: FCAPDAT Mask         */

#define BPWM_RCAPDAT5_RCAPDAT_Pos        (0)                                               /*!< BPWM_T::RCAPDAT5: RCAPDAT Position     */
#define BPWM_RCAPDAT5_RCAPDAT_Msk        (0xfffful << BPWM_RCAPDAT5_RCAPDAT_Pos)           /*!< BPWM_T::RCAPDAT5: RCAPDAT Mask         */

#define BPWM_FCAPDAT5_FCAPDAT_Pos        (0)                                               /*!< BPWM_T::FCAPDAT5: FCAPDAT Position     */
#define BPWM_FCAPDAT5_FCAPDAT_Msk        (0xfffful << BPWM_FCAPDAT5_FCAPDAT_Pos)           /*!< BPWM_T::FCAPDAT5: FCAPDAT Mask         */

#define BPWM_CAPIEN_CAPRIEN0_Pos          (0)                                              /*!< BPWM_T::CAPIEN: CAPRIEN0 Position      */
#define BPWM_CAPIEN_CAPRIEN0_Msk          (0x1ul << BPWM_CAPIEN_CAPRIEN0_Pos)              /*!< BPWM_T::CAPIEN: CAPRIEN0 Mask          */

